# Напишите выражение (задание на самопроверку).
# Дано n-значное целое число N. Определить: входят ли в него цифры 3 и 7.

print('3' and '7' in str(123456789))
